from ttkwidgets.autocomplete import AutocompleteCombobox
from tkinter import *



countries = [
        "Алжир", "Намибия", "Ангола", "Нигер", "Бенин", "Нигерия", "Ботсвана", "Республика Конго", "Буркина-Фасо", "Бурунди", "Руанда", "Габон", "Сан-Томе и Принсипи", "Гамбия", "Гана", "Свазиленд", "Гвинея", "Сейшельские Острова", "Гвинея-Бисау", "Джибути", "Сенегал", "ДР Конго", "Сомали", "Египет", "Судан", "Замбия", "Сьерра-Леоне", "Зимбабве", "Танзания", "Кабо-Верде", "Того", "Камерун", "Тунис", "Кения", "Уганда", "Коморы", "ЦАР", "Кот-д’Ивуар", "Лесото", "Либерия", "Чад", "Ливия", "Экваториальная Гвинея", "Маврикий", "Мавритания", "Эритрея", "Мадагаскар", "Эфиопия", "ЮАР", "Малави", "Мали", "Марокко", "Южный Судан", "Мозамбик", "Эсватини"
        ]
capitals = [
"Алжир", "Виндхук", "Луанда", "Ниамей", "Порто-Ново", "Абуджа", "Габороне", "Браззавиль", "Уагадугу", "Бужумбура (Гитега)", "Кигали", "Либревиль", "Сан-Томе", "Банжул", "Аккра", "Мбабане", "Конакри", "Виктория", "Бисау", "Джибути", "Дакар", "Киншаса", "Могадишу", "Каир", "Хартум", "Лусака", "Фритаун", "Хараре", "Додома", "Прая", "Ломе", "Яунде", "Тунис", "Найроби", "Кампала", "Морони", "Банги", "Ямусукро (Абиджан)", "Масеру", "Монровия", "Нджамена", "Триполи", "Малабо", "Порт-Луи", "Нуакшот", "Асмэра", "Антананариву", "Аддис-Абеба", "Претория (Кейптаун)", "Лилонгве", "Бамако", "Рабат", "Джуба", "Мапуту", "Мбабане (Лобамба)"
]

def check_input(event):
    value = event.widget.get()

    if len(event.keysym) == 1:
        event.widget.autocomplete()

    if value == '':
        entry['values'] = countries
    else:
        data = []
        for item in countries:
            if value.lower() in item[0:len(value)].lower():
                data.append(item)
        entry['values'] = data

ws = Tk()
ws.title('PythonGuides')
ws.geometry('400x300')
ws.config(bg='#8DBF5A')

frame = Frame(ws, bg='#8DBF5A')
frame.pack(expand=True)

Label(
    frame,
    bg='#8DBF5A',
    font = ('Times',21),
    text='Countries in North America '
    ).pack()

entry = AutocompleteCombobox(
    frame,
    width=30,
    font=('Times', 18),
    completevalues=countries
    )

entry.bind('<KeyRelease>', check_input)

entry.pack()
ws.mainloop()